ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/device/TMPM4KNA.h
/**
 *******************************************************************************
 * @file    TMPM4KNA.h
 * @brief   CMSIS Cortex-M4 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM4KNA' Device Series
 * @version V1.0.0.0
 * $Date::            #$
 *
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 *
 * Copyright(C) Toshiba Electronic Device Solutions Corporation 2021
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TXZ_MICROCONTROLLER
  * @{
  */

/** @addtogroup TMPM4KNA
  * @{
  */

#ifndef __TMPM4KNA_H__
#define __TMPM4KNA_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn {
    /******  Cortex-M4 Processor Exceptions Numbers ***************************************************************/
    NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
    HardFault_IRQn                = -13,       /*!< 3 Cortex-M4 Hard Fault Interrupt                            */
    MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M4 Memory Management Interrupt                     */
    BusFault_IRQn                 = -11,       /*!< 5 Cortex-M4 Bus Fault Interrupt                             */
    UsageFault_IRQn               = -10,       /*!< 6 Cortex-M4 Usage Fault Interrupt                           */
    SVCall_IRQn                   = -5,        /*!< 11 Cortex-M4 SV Call Interrupt                              */
    DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M4 Debug Monitor Interrupt                        */
    PendSV_IRQn                   = -2,        /*!< 14 Cortex-M4 Pend SV Interrupt                              */
    SysTick_IRQn                  = -1,        /*!< 15 Cortex-M4 System Tick Interrupt                          */

    /******  TMPM4KNA Specific Interrupt Numbers *******************************************************************/
    INT00_IRQn                    = 0,         /*!< Interrupt pin 00                                            */
    INT01_IRQn                    = 1,         /*!< Interrupt pin 01a/00b                                       */
    INT02_IRQn                    = 2,         /*!< Interrupt pin 02a/00b                                       */
    INT03_IRQn                    = 3,         /*!< Interrupt pin 03a/03b                                       */
    INT04_IRQn                    = 4,         /*!< Interrupt pin 04a/04b                                       */
    INT05_IRQn                    = 5,         /*!< Interrupt pin 05a/05b                                       */
    INT06_IRQn                    = 6,         /*!< Interrupt pin 06a/06b                                       */
    INT07_IRQn                    = 7,         /*!< Interrupt pin 07a/07b                                       */
    INT08_IRQn                    = 8,         /*!< Interrupt pin 08a/08b                                       */
    INT09_IRQn                    = 9,         /*!< Interrupt pin 09                                            */
    INT10_IRQn                    = 10,        /*!< Interrupt pin 10                                            */
    INT11_IRQn                    = 11,        /*!< Interrupt pin 11a/11b                                       */
    INT12_IRQn                    = 12,        /*!< Interrupt pin 12                                            */
    INT13_IRQn                    = 13,        /*!< Interrupt pin 13                                            */
    INT14_IRQn                    = 14,        /*!< Interrupt pin 14a/14b                                       */
    INT15_IRQn                    = 15,        /*!< Interrupt pin 15                                            */
    INT16_IRQn                    = 16,        /*!< Interrupt pin 16a/16b                                       */
    INT17_IRQn                    = 17,        /*!< Interrupt pin 17a/17b                                       */
    INT18_IRQn                    = 18,        /*!< Interrupt pin 18a/18b                                       */
    INT21_IRQn                    = 21,        /*!< Interrupt pin 21                                            */
    INTVCN0_IRQn                  = 22,        /*!< A-VE+ ch0 Interrupt                                         */
    INTVCT0_IRQn                  = 23,        /*!< A-VE+ ch0 Task termination interrupt                        */
    INTEMG0_IRQn                  = 24,        /*!< A-PMD ch0 EMG interrupt                                     */
    INTEMG1_IRQn                  = 25,        /*!< A-PMD ch1 EMG interrupt                                     */
    INTEMG2_IRQn                  = 26,        /*!< A-PMD ch2 EMG interrupt                                     */
    INTOVV0_IRQn                  = 27,        /*!< A-PMD ch0 OVV interrupt                                     */
    INTOVV1_IRQn                  = 28,        /*!< A-PMD ch1 OVV interrupt                                     */
    INTOVV2_IRQn                  = 29,        /*!< A-PMD ch2 OVV interrupt                                     */
    INTPWM0_IRQn                  = 30,        /*!< A-PMD ch0 PWM interrupt                                     */
    INTPWM1_IRQn                  = 31,        /*!< A-PMD ch1 PWM interrupt                                     */
    INTPWM2_IRQn                  = 32,        /*!< A-PMD ch2 PWM interrupt                                     */
    INTENC00_IRQn                 = 33,        /*!< A-ENC32 ch0 Encoder interrupt 0                             */
    INTENC01_IRQn                 = 34,        /*!< A-ENC32 ch0 Encoder interrupt 1                             */
    INTENC10_IRQn                 = 35,        /*!< A-ENC32 ch1 Encoder interrupt 0                             */
    INTENC11_IRQn                 = 36,        /*!< A-ENC32 ch1 Encoder interrupt 1                             */
    INTENC20_IRQn                 = 37,        /*!< A-ENC32 ch2 Encoder interrupt 0                             */
    INTENC21_IRQn                 = 38,        /*!< A-ENC32 ch2 Encoder interrupt 1                             */
    INTADAPDA_IRQn                = 39,        /*!< ADC unit A PMD trigger program interrupt A                  */
    INTADAPDB_IRQn                = 40,        /*!< ADC unit A PMD trigger program interrupt B                  */
    INTADACP0_IRQn                = 41,        /*!< ADC unit A Monitor function 0 interrupt                     */
    INTADACP1_IRQn                = 42,        /*!< ADC unit A Monitor function 1 interrupt                     */
    INTADATRG_IRQn                = 43,        /*!< ADC unit A General purpose trigger program interrupt        */
    INTADASGL_IRQn                = 44,        /*!< ADC unit A Single program interrupt                         */
    INTADACNT_IRQn                = 45,        /*!< ADC unit A Continuity program interrupt                     */
    INTADBPDA_IRQn                = 46,        /*!< ADC unit B PMD trigger program interrupt A                  */
    INTADBPDB_IRQn                = 47,        /*!< ADC unit B PMD trigger program interrupt B                  */
    INTADBCP0_IRQn                = 48,        /*!< ADC unit B Monitor function 0 interrupt                     */
    INTADBCP1_IRQn                = 49,        /*!< ADC unit B Monitor function 1 interrupt                     */
    INTADBTRG_IRQn                = 50,        /*!< ADC unit B General purpose trigger program interrupt        */
    INTADBSGL_IRQn                = 51,        /*!< ADC unit B Single program interrupt                         */
    INTADBCNT_IRQn                = 52,        /*!< ADC unit B Continuity program interrupt                     */
    INTADCPDA_IRQn                = 53,        /*!< ADC unit C PMD trigger program interrupt A                  */
    INTADCPDB_IRQn                = 54,        /*!< ADC unit C PMD trigger program interrupt B                  */
    INTADCCP0_IRQn                = 55,        /*!< ADC unit C Monitor function 0 interrupt                     */
    INTADCCP1_IRQn                = 56,        /*!< ADC unit C Monitor function 1 interrupt                     */
    INTADCTRG_IRQn                = 57,        /*!< ADC unit C General purpose trigger program interrupt        */
    INTADCSGL_IRQn                = 58,        /*!< ADC unit C Single program interrupt                         */
    INTADCCNT_IRQn                = 59,        /*!< ADC unit C Continuity program interrupt                     */
    INTSC0RX_IRQn                 = 60,        /*!< TSPI/UART ch0 Reception interrupt                           */
    INTSC0TX_IRQn                 = 61,        /*!< TSPI/UART ch0 Transmit interrupt                            */
    INTSC0ERR_IRQn                = 62,        /*!< TSPI/UART ch0 Error interrupt                               */
    INTSC1RX_IRQn                 = 63,        /*!< TSPI/UART ch1 Reception interrupt                           */
    INTSC1TX_IRQn                 = 64,        /*!< TSPI/UART ch1 Transmit interrupt                            */
    INTSC1ERR_IRQn                = 65,        /*!< TSPI/UART ch1 Error interrupt                               */
    INTSC2RX_IRQn                 = 66,        /*!< UART ch2 Reception interrupt                                */
    INTSC2TX_IRQn                 = 67,        /*!< UART ch2 Transmit interrupt                                 */
    INTSC2ERR_IRQn                = 68,        /*!< UART ch2 Error interrupt                                    */
    INTSC3RX_IRQn                 = 69,        /*!< UART ch3 Reception interrupt                                */
    INTSC3TX_IRQn                 = 70,        /*!< UART ch3 Transmit interrupt                                 */
    INTSC3ERR_IRQn                = 71,        /*!< UART ch3 Error interrupt                                    */
    INTI2C0NST_IRQn               = 72,        /*!< I2C ch0 Interrupt / EI2C ch0 Status interrupt               */
    INTI2C0ATX_IRQn               = 73,        /*!< I2C ch0 Arbitration lost detection interrupt / EI2C ch0 Transmission buffer empty interrupt*/
    INTI2C0BRX_IRQn               = 74,        /*!< I2C ch0 Bus free detection interrupt / EI2C ch0 Reception buffer full interrupt*/
    INTI2C0NA_IRQn                = 75,        /*!< I2C ch0 NACK detection interrupt                            */
    INTI2C1NST_IRQn               = 76,        /*!< I2C ch1 Interrupt / EI2C ch1 Status interrupt               */
    INTI2C1ATX_IRQn               = 77,        /*!< I2C ch1 Arbitration lost detection interrupt / EI2C ch1 Transmission buffer empty interrupt*/
    INTI2C1BRX_IRQn               = 78,        /*!< I2C ch1 Bus free detection interrupt / EI2C ch1 Reception buffer full interrupt*/
    INTI2C1NA_IRQn                = 79,        /*!< I2C ch1 NACK detection interrupt                            */
    INTT32A00AC_IRQn              = 83,        /*!< T32A ch0 Timer A/C Compare match detection / Over flow / Under flow*/
    INTT32A00ACCAP0_IRQn          = 84,        /*!< T32A ch0 Timer A/C Input capture 0                          */
    INTT32A00ACCAP1_IRQn          = 85,        /*!< T32A ch0 Timer A/C Input capture 1                          */
    INTT32A00B_IRQn               = 86,        /*!< T32A ch0 Timer B Compare match detection / Over flow / Under flow*/
    INTT32A00BCAP0_IRQn           = 87,        /*!< T32A ch0 Timer B Input capture 0                            */
    INTT32A00BCAP1_IRQn           = 88,        /*!< T32A ch0 Timer B Input capture 1                            */
    INTT32A01AC_IRQn              = 89,        /*!< T32A ch1 Timer A/C Compare match detection / Over flow / Under flow*/
    INTT32A01ACCAP0_IRQn          = 90,        /*!< T32A ch1 Timer A/C Input capture 0                          */
    INTT32A01ACCAP1_IRQn          = 91,        /*!< T32A ch1 Timer A/C Input capture 1                          */
    INTT32A01B_IRQn               = 92,        /*!< T32A ch1 Timer B Compare match detection / Over flow / Under flow*/
    INTT32A01BCAP0_IRQn           = 93,        /*!< T32A ch1 Timer B Input capture 0                            */
    INTT32A01BCAP1_IRQn           = 94,        /*!< T32A ch1 Timer B Input capture 1                            */
    INTT32A02AC_IRQn              = 95,        /*!< T32A ch2 Timer A/C Compare match detection / Over flow / Under flow*/
    INTT32A02ACCAP0_IRQn          = 96,        /*!< T32A ch2 Timer A/C Input capture 0                          */
    INTT32A02ACCAP1_IRQn          = 97,        /*!< T32A ch2 Timer A/C Input capture 1                          */
    INTT32A02B_IRQn               = 98,        /*!< T32A ch2 Timer B Compare match detection / Over flow / Under flow*/
    INTT32A02BCAP0_IRQn           = 99,        /*!< T32A ch2 Timer B Input capture 0                            */
    INTT32A02BCAP1_IRQn           = 100,       /*!< T32A ch2 Timer B Input capture 1                            */
    INTT32A03AC_IRQn              = 101,       /*!< T32A ch3 Timer A/C Compare match detection / Over flow / Under flow*/
    INTT32A03ACCAP0_IRQn          = 102,       /*!< T32A ch3 Timer A/C Input capture 0                          */
    INTT32A03ACCAP1_IRQn          = 103,       /*!< T32A ch3 Timer A/C Input capture 1                          */
    INTT32A03B_IRQn               = 104,       /*!< T32A ch3 Timer B Compare match detection / Over flow / Under flow*/
    INTT32A03BCAP0_IRQn           = 105,       /*!< T32A ch3 Timer B Input capture 0                            */
    INTT32A03BCAP1_IRQn           = 106,       /*!< T32A ch3 Timer B Input capture 1                            */
    INTT32A04AC_IRQn              = 107,       /*!< T32A ch4 Timer A/C Compare match detection / Over flow / Under flow*/
    INTT32A04ACCAP0_IRQn          = 108,       /*!< T32A ch4 Timer A/C Input capture 0                          */
    INTT32A04ACCAP1_IRQn          = 109,       /*!< T32A ch4 Timer A/C Input capture 1                          */
    INTT32A04B_IRQn               = 110,       /*!< T32A ch4 Timer B Compare match detection / Over flow / Under flow*/
    INTT32A04BCAP0_IRQn           = 111,       /*!< T32A ch4 Timer B Input capture 0                            */
    INTT32A04BCAP1_IRQn           = 112,       /*!< T32A ch4 Timer B Input capture 1                            */
    INTT32A05AC_IRQn              = 113,       /*!< T32A ch5 Timer A/C Compare match detection / Over flow / Under flow*/
    INTT32A05ACCAP0_IRQn          = 114,       /*!< T32A ch5 Timer A/C Input capture 0                          */
    INTT32A05ACCAP1_IRQn          = 115,       /*!< T32A ch5 Timer A/C Input capture 1                          */
    INTT32A05B_IRQn               = 116,       /*!< T32A ch5 Timer B Compare match detection / Over flow / Under flow*/
    INTT32A05BCAP0_IRQn           = 117,       /*!< T32A ch5 Timer B Input capture 0                            */
    INTT32A05BCAP1_IRQn           = 118,       /*!< T32A ch5 Timer B Input capture 1                            */
    INTPARI0_IRQn                 = 119,       /*!< RAMP ch0 Parity error interrupt                             */
    INTPARI1_IRQn                 = 120,       /*!< RAMP ch1 Parity error interrupt                             */
    INTDMAATC_IRQn                = 121,       /*!< DMAC unit A End of transfer (ch0 - 31)                      */
    INTDMAAERR_IRQn               = 122,       /*!< DMAC unit A Transfer error                                  */
    INTFLCRDY_IRQn                = 123,       /*!< Code FLASH Ready interrupt                                  */
    INTFLDRDY_IRQn                = 124        /*!< Data FLASH Ready interrupt                                  */
} IRQn_Type;

