ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4KN/device/TMPM4KNA.h
/**
  * @brief 32-bit Timer Event Counter (T32A)
  */
typedef struct {
    __IO uint32_t MOD;               /*!< T32A Mode Register                           */
    uint32_t RESERVED0[15];
    __IO uint32_t RUNA;              /*!< T32A Run Register A                          */
    __IO uint32_t CRA;               /*!< T32A Control Register A                      */
    __IO uint32_t CAPCRA;            /*!< T32A Capture Control Register A              */
    __O  uint32_t OUTCRA0;           /*!< T32A Output Control Register A0              */
    __IO uint32_t OUTCRA1;           /*!< T32A Output Control Register A1              */
    __IO uint32_t STA;               /*!< T32A Status Register A                       */
    __IO uint32_t IMA;               /*!< T32A Interrupt Mask Register A               */
    __I  uint32_t TMRA;              /*!< T32A Counter Capture Register A              */
    __IO uint32_t RELDA;             /*!< T32A Reload Register A                       */
    __IO uint32_t RGA0;              /*!< T32A Timer Register A0                       */
    __IO uint32_t RGA1;              /*!< T32A Timer Register A1                       */
    __I  uint32_t CAPA0;             /*!< T32A Capture Register A0                     */
    __I  uint32_t CAPA1;             /*!< T32A Capture Register A1                     */
    __IO uint32_t DMAA;              /*!< T32A DMA Request Enable Register A           */
    __I  uint32_t CPA0;              /*!< T32A Compare Register A0                     */
    __I  uint32_t CPA1;              /*!< T32A Compare Register A1                     */
    __IO uint32_t RUNB;              /*!< T32A Run Register B                          */
    __IO uint32_t CRB;               /*!< T32A Control Register B                      */
    __IO uint32_t CAPCRB;            /*!< T32A Capture Control Register B              */
    __O  uint32_t OUTCRB0;           /*!< T32A Output Control Register B0              */
    __IO uint32_t OUTCRB1;           /*!< T32A Output Control Register B1              */
    __IO uint32_t STB;               /*!< T32A Status Register B                       */
    __IO uint32_t IMB;               /*!< T32A Interrupt Mask Register B               */
    __I  uint32_t TMRB;              /*!< T32A Counter Capture Register B              */
    __IO uint32_t RELDB;             /*!< T32A Reload Register B                       */
    __IO uint32_t RGB0;              /*!< T32A Timer Register B0                       */
    __IO uint32_t RGB1;              /*!< T32A Timer Register B1                       */
    __I  uint32_t CAPB0;             /*!< T32A Capture Register B0                     */
    __I  uint32_t CAPB1;             /*!< T32A Capture Register B1                     */
    __IO uint32_t DMAB;              /*!< T32A DMA Request Enable Register B           */
    __I  uint32_t CPB0;              /*!< T32A Compare Register B0                     */
    __I  uint32_t CPB1;              /*!< T32A Compare Register B1                     */
    __IO uint32_t RUNC;              /*!< T32A Run Register C                          */
    __IO uint32_t CRC;               /*!< T32A Control Register C                      */
    __IO uint32_t CAPCRC;            /*!< T32A Capture Control Register C              */
    __O  uint32_t OUTCRC0;           /*!< T32A Output Control Register C0              */
    __IO uint32_t OUTCRC1;           /*!< T32A Output Control Register C1              */
    __IO uint32_t STC;               /*!< T32A Status Register C                       */
    __IO uint32_t IMC;               /*!< T32A Interrupt Mask Register C               */
    __I  uint32_t TMRC;              /*!< T32A Counter Capture Register C              */
    __IO uint32_t RELDC;             /*!< T32A Reload Register C                       */
    __IO uint32_t RGC0;              /*!< T32A Timer Register C0                       */
    __IO uint32_t RGC1;              /*!< T32A Timer Register C1                       */
    __I  uint32_t CAPC0;             /*!< T32A Capture Register C0                     */
    __I  uint32_t CAPC1;             /*!< T32A Capture Register C1                     */
    __IO uint32_t DMAC;              /*!< T32A DMA Request Enable Register C           */
    __IO uint32_t PLSCR;             /*!< T32A Pulse Count Control Register            */
    __I  uint32_t CPC0;              /*!< T32A Compare Register C0                     */
    __I  uint32_t CPC1;              /*!< T32A Compare Register C1                     */
} TSB_T32A_TypeDef;

/**
  * @brief Serial Peripheral Interface (TSPI)
  */
typedef struct {
    __IO uint32_t CR0;               /*!< TSPI Control Register 0                      */
    __IO uint32_t CR1;               /*!< TSPI Control Register 1                      */
    __IO uint32_t CR2;               /*!< TSPI Control Register 2                      */
    __IO uint32_t CR3;               /*!< TSPI Control Register 3                      */
    __IO uint32_t BR;                /*!< TSPI Baud Rate Generator Control Register    */
    __IO uint32_t FMTR0;             /*!< TSPI Format Control Register 0               */
    __IO uint32_t FMTR1;             /*!< TSPI Format Control Register 1               */
    __IO uint32_t SECTCR0;           /*!< TSPI Sector Mode Control Register 0          */
    __IO uint32_t SECTCR1;           /*!< TSPI Sector Mode Control Register 1          */
    uint32_t RESERVED0[55];
    __IO uint32_t DR;                /*!< TSPI Data Register                           */
    uint32_t RESERVED1[63];
    __IO uint32_t SR;                /*!< TSPI Status Register                         */
    __IO uint32_t ERR;               /*!< TSPI Parity Error Flag Register              */
} TSB_TSPI_TypeDef;

/**
  * @brief Asynchronous Serial Communication Circuit (UART)
  */
typedef struct {
    __IO uint32_t SWRST;             /*!< UART Software Reset Register                 */
    __IO uint32_t CR0;               /*!< UART Control Register 0                      */
    __IO uint32_t CR1;               /*!< UART Control Register 1                      */
    __IO uint32_t CLK;               /*!< UART Clock Control Register                  */
    __IO uint32_t BRD;               /*!< UART Baud Rate Register                      */
    __IO uint32_t TRANS;             /*!< UART Transfer Enable Register                */
    __IO uint32_t DR;                /*!< UART Data Register                           */
    __IO uint32_t SR;                /*!< UART Status Register                         */
    __O  uint32_t FIFOCLR;           /*!< UART FIFO Clear Register                     */
    __IO uint32_t ERR;               /*!< UART Error Register                          */
} TSB_UART_TypeDef;

#if defined ( __CC_ARM   )           /* RealView Compiler */
#pragma anon_unions
#elif (defined (__ICCARM__))         /*  ICC Compiler     */
#pragma language=extended
#endif

/**
  * @brief I2C Interface (I2C)
  */
typedef struct {
    __IO uint32_t CR1;               /*!< I2C Control Register 1                       */
    __IO uint32_t DBR;               /*!< Data Buffer Register                         */
    __IO uint32_t AR;                /*!< Bus address Register                         */
    union {
        __O  uint32_t CR2;               /*!< Control Register 2                           */
        __I  uint32_t SR;                /*!< Status Register                              */
    };
    __IO uint32_t PRS;               /*!< Prescaler clock setting Register             */
    __IO uint32_t IE;                /*!< Interrupt Enable Register                    */
    __IO uint32_t ST;                /*!< Interrupt Register                           */
    __IO uint32_t OP;                /*!< Optional Function register                   */
    __I  uint32_t PM;                /*!< Bus Monitor register                         */
    __IO uint32_t AR2;               /*!< Second Slave address register                */
} TSB_I2C_TypeDef;

/**
  * @brief I2C Interface Version A (EI2C)
  */
typedef struct {
    __IO uint32_t ARST;              /*!< EI2C Reset Register                          */
    __IO uint32_t AEN;               /*!< EI2C Enable Register                         */
    __IO uint32_t ACR0;              /*!< EI2C Control Register 0                      */
    __IO uint32_t ACR1;              /*!< EI2C Control Register 1                      */
    __IO uint32_t ADBRT;             /*!< EI2C Transmit Data Buffer Register           */
    __I  uint32_t ADBRR;             /*!< EI2C Receive Data Buffer Register            */
    __I  uint32_t ASR0;              /*!< EI2C Status Register 0                       */
    __IO uint32_t ASR1;              /*!< EI2C Status Register 1                       */
    __IO uint32_t APRS;              /*!< EI2C Prescaler Clock Setting Register        */
    __IO uint32_t ASCL;              /*!< EI2C SCL Width Setting Register              */
    __IO uint32_t AAR1;              /*!< EI2C First Slave Address Register            */
    __IO uint32_t AAR2;              /*!< EI2C Second Slave Address Register           */
    __IO uint32_t AIE;               /*!< EI2C Interrupt/DMA Setting Register          */
    __I  uint32_t APM;               /*!< EI2C Bus Terminal Monitor Register           */
} TSB_EI2C_TypeDef;

/**
  * @brief Port A
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port A Data Register                         */
    __IO uint32_t CR;                /*!< Port A Output Control Register               */
    __IO uint32_t FR1;               /*!< Port A Function Register 1                   */
    uint32_t RESERVED0[2];
    __IO uint32_t FR4;               /*!< Port A Function Register 4                   */
    __IO uint32_t FR5;               /*!< Port A Function Register 5                   */
    __IO uint32_t FR6;               /*!< Port A Function Register 6                   */
    __IO uint32_t FR7;               /*!< Port A Function Register 7                   */
    uint32_t RESERVED1;
    __IO uint32_t OD;                /*!< Port A Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port A Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port A Pull-down Control Register            */
    uint32_t RESERVED2;
    __IO uint32_t IE;                /*!< Port A Input Control Register                */
} TSB_PA_TypeDef;

/**
  * @brief Port B
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port B Data Register                         */
    __IO uint32_t CR;                /*!< Port B Output Control Register               */
    uint32_t RESERVED0[3];
    __IO uint32_t FR4;               /*!< Port B Function Register 4                   */
    __IO uint32_t FR5;               /*!< Port B Function Register 5                   */
    uint32_t RESERVED1[3];
    __IO uint32_t OD;                /*!< Port B Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port B Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port B Pull-down Control Register            */
    uint32_t RESERVED2;
    __IO uint32_t IE;                /*!< Port B Input Control Register                */
} TSB_PB_TypeDef;

/**
  * @brief Port C
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port C Data Register                         */
    __IO uint32_t CR;                /*!< Port C Output Control Register               */
    __IO uint32_t FR1;               /*!< Port C Function Register 1                   */
    __IO uint32_t FR2;               /*!< Port C Function Register 2                   */
    __IO uint32_t FR3;               /*!< Port C Function Register 3                   */
    __IO uint32_t FR4;               /*!< Port C Function Register 4                   */
    __IO uint32_t FR5;               /*!< Port C Function Register 5                   */
    __IO uint32_t FR6;               /*!< Port C Function Register 6                   */
    __IO uint32_t FR7;               /*!< Port C Function Register 7                   */
    uint32_t RESERVED0;
    __IO uint32_t OD;                /*!< Port C Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port C Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port C Pull-down Control Register            */
    uint32_t RESERVED1;
    __IO uint32_t IE;                /*!< Port C Input Control Register                */
} TSB_PC_TypeDef;

/**
  * @brief Port D
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port D Data Register                         */
    __IO uint32_t CR;                /*!< Port D Output Control Register               */
    __IO uint32_t FR1;               /*!< Port D Function Register 1                   */
    __IO uint32_t FR2;               /*!< Port D Function Register 2                   */
    __IO uint32_t FR3;               /*!< Port D Function Register 3                   */
    __IO uint32_t FR4;               /*!< Port D Function Register 4                   */
    __IO uint32_t FR5;               /*!< Port D Function Register 5                   */
    __IO uint32_t FR6;               /*!< Port D Function Register 6                   */
    uint32_t RESERVED0[2];
    __IO uint32_t OD;                /*!< Port D Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port D Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port D Pull-down Control Register            */
    uint32_t RESERVED1;
    __IO uint32_t IE;                /*!< Port D Input Control Register                */
} TSB_PD_TypeDef;

/**
  * @brief Port E
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port E Data Register                         */
    __IO uint32_t CR;                /*!< Port E Output Control Register               */
    uint32_t RESERVED0[3];
    __IO uint32_t FR4;               /*!< Port E Function Register 4                   */
    __IO uint32_t FR5;               /*!< Port E Function Register 5                   */
    __IO uint32_t FR6;               /*!< Port E Function Register 6                   */
    __IO uint32_t FR7;               /*!< Port E Function Register 7                   */
    uint32_t RESERVED1;
    __IO uint32_t OD;                /*!< Port E Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port E Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port E Pull-down Control Register            */
    uint32_t RESERVED2;
    __IO uint32_t IE;                /*!< Port E Input Control Register                */
} TSB_PE_TypeDef;

/**
  * @brief Port F
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port F Data Register                         */
    __IO uint32_t CR;                /*!< Port F Output Control Register               */
    __IO uint32_t FR1;               /*!< Port F Function Register 1                   */
    __IO uint32_t FR2;               /*!< Port F Function Register 2                   */
    __IO uint32_t FR3;               /*!< Port F Function Register 3                   */
    __IO uint32_t FR4;               /*!< Port F Function Register 4                   */
    __IO uint32_t FR5;               /*!< Port F Function Register 5                   */
    __IO uint32_t FR6;               /*!< Port F Function Register 6                   */
    __IO uint32_t FR7;               /*!< Port F Function Register 7                   */
    uint32_t RESERVED0;
    __IO uint32_t OD;                /*!< Port F Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port F Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port F Pull-down Control Register            */
    uint32_t RESERVED1;
    __IO uint32_t IE;                /*!< Port F Input Control Register                */
} TSB_PF_TypeDef;

/**
  * @brief Port G
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port G Data Register                         */
    __IO uint32_t CR;                /*!< Port G Output Control Register               */
    __IO uint32_t FR1;               /*!< Port G Function Register 1                   */
    uint32_t RESERVED0[2];
    __IO uint32_t FR4;               /*!< Port G Function Register 4                   */
    __IO uint32_t FR5;               /*!< Port G Function Register 5                   */
    uint32_t RESERVED1[3];
    __IO uint32_t OD;                /*!< Port G Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port G Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port G Pull-down Control Register            */
    uint32_t RESERVED2;
    __IO uint32_t IE;                /*!< Port G Input Control Register                */
} TSB_PG_TypeDef;

/**
  * @brief Port H
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port H Data Register                         */
    uint32_t RESERVED0[11];
    __IO uint32_t PDN;               /*!< Port H Pull-down Control Register            */
    uint32_t RESERVED1;
    __IO uint32_t IE;                /*!< Port H Input Control Register                */
} TSB_PH_TypeDef;

/**
  * @brief Port J
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port J Data Register                         */
    __IO uint32_t CR;                /*!< Port J Output Control Register               */
    uint32_t RESERVED0[8];
    __IO uint32_t OD;                /*!< Port J Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port J Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port J Pull-down Control Register            */
    uint32_t RESERVED1;
    __IO uint32_t IE;                /*!< Port J Input Control Register                */
} TSB_PJ_TypeDef;

/**
  * @brief Port K
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port K Data Register                         */
    __IO uint32_t CR;                /*!< Port K Output Control Register               */
    uint32_t RESERVED0[8];
    __IO uint32_t OD;                /*!< Port K Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port K Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port K Pull-down Control Register            */
    uint32_t RESERVED1;
    __IO uint32_t IE;                /*!< Port K Input Control Register                */
} TSB_PK_TypeDef;

/**
  * @brief Port L
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port L Data Register                         */
    __IO uint32_t CR;                /*!< Port L Output Control Register               */
    uint32_t RESERVED0[8];
    __IO uint32_t OD;                /*!< Port L Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port L Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port L Pull-down Control Register            */
    uint32_t RESERVED1;
    __IO uint32_t IE;                /*!< Port L Input Control Register                */
} TSB_PL_TypeDef;

/**
  * @brief Port M
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port M Data Register                         */
    __IO uint32_t CR;                /*!< Port M Output Control Register               */
    uint32_t RESERVED0[8];
    __IO uint32_t OD;                /*!< Port M Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port M Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port M Pull-down Control Register            */
    uint32_t RESERVED1;
    __IO uint32_t IE;                /*!< Port M Input Control Register                */
} TSB_PM_TypeDef;

/**
  * @brief Port N
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port N Data Register                         */
    __IO uint32_t CR;                /*!< Port N Output Control Register               */
    __IO uint32_t FR1;               /*!< Port N Function Register 1                   */
    __IO uint32_t FR2;               /*!< Port N Function Register 2                   */
    __IO uint32_t FR3;               /*!< Port N Function Register 3                   */
    __IO uint32_t FR4;               /*!< Port N Function Register 4                   */
    __IO uint32_t FR5;               /*!< Port N Function Register 5                   */
    __IO uint32_t FR6;               /*!< Port N Function Register 6                   */
    __IO uint32_t FR7;               /*!< Port N Function Register 7                   */
    uint32_t RESERVED0;
    __IO uint32_t OD;                /*!< Port N Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port N Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port N Pull-down Control Register            */
    uint32_t RESERVED1;
    __IO uint32_t IE;                /*!< Port N Input Control Register                */
} TSB_PN_TypeDef;

/**
  * @brief Port U
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port U Data Register                         */
    __IO uint32_t CR;                /*!< Port U Output Control Register               */
    __IO uint32_t FR1;               /*!< Port U Function Register 1                   */
    __IO uint32_t FR2;               /*!< Port U Function Register 2                   */
    __IO uint32_t FR3;               /*!< Port U Function Register 3                   */
    __IO uint32_t FR4;               /*!< Port U Function Register 4                   */
    __IO uint32_t FR5;               /*!< Port U Function Register 5                   */
    __IO uint32_t FR6;               /*!< Port U Function Register 6                   */
    __IO uint32_t FR7;               /*!< Port U Function Register 7                   */
    uint32_t RESERVED0;
    __IO uint32_t OD;                /*!< Port U Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port U Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port U Pull-down Control Register            */
    uint32_t RESERVED1;
    __IO uint32_t IE;                /*!< Port U Input Control Register                */
} TSB_PU_TypeDef;

/**
  * @brief Port V
  */
typedef struct {
    __IO uint32_t DATA;              /*!< Port V Data Register                         */
    __IO uint32_t CR;                /*!< Port V Output Control Register               */
    __IO uint32_t FR1;               /*!< Port V Function Register 1                   */
    __IO uint32_t FR2;               /*!< Port V Function Register 2                   */
    uint32_t RESERVED0;
    __IO uint32_t FR4;               /*!< Port V Function Register 4                   */
    uint32_t RESERVED1[4];
    __IO uint32_t OD;                /*!< Port V Open Drain Control Register           */
    __IO uint32_t PUP;               /*!< Port V Pull-up Control Register              */
    __IO uint32_t PDN;               /*!< Port V Pull-down Control Register            */
    uint32_t RESERVED2;
    __IO uint32_t IE;                /*!< Port V Input Control Register                */
} TSB_PV_TypeDef;

